[
{name:'IoT Internet of Things', description:'<p>The ability for anyone to make <b>things</b> using cheap open-source hardware and software together with the croud-funding financing that remove any barrier to entry will drive new and unexpected innovations. These may come from unlikely sources - I wouln`t be surprised if some of the next big-things originate from so-called developing-markets since the technology is now at a price-point that 10`s of millions of hobbiests can experiment.</p> <p>My research is based on simple `maker` projects using <b>Arduino</b>, <b>Raspberry Pi</b> and various cloud services and using various shields for Cellular communication, X10 home automation etc. It also includes wiring IoT `things` using cloud services on <b>Amazon</b>, <b>Heroku</b>, <b>IBM Bluemix</b> and others. For development I`ve been experimenting with Node.js and Node-Red.</p>', projects:[
{id:'IoT1', name:'Node-Red on Raspberry Pi', description:'Raspberry Pi provides a very low-cost Linux computer to run IoT Applications. I have built many small applications, mainly using the Node-Red event based development environmnet. I configure Node-Red on my Raspberry Pi cards using <a href="http://thethingbox.io/">thethingbox.io</a>. <ul><li>My Node-Red flows are available at <a href="https://github.com/LesterThomas/NodeRed-flows">Node-Red flows on Github</a>. I have many flows from capturing car telemetry to logging home heating systems to reading out the local weather each morning on my Sonos.</li><li>My custom Node-Red nodes are available at <a href="https://github.com/LesterThomas/NodeRed-Nodes">Node-Red nodes on Github</a>. I have built nodes for communicating with a Sonos media player and for exposing the performance of the Raspberry Pi.</li></ul>'},
{id:'IoT2', name:'Node-Red on IBM Bluemix', description:'IBM Bluemix provides a platform-as-a-service with many in-built services. I have created two simple apps.<ul><li>A simple server for a Quiz application (allows users to buzz on a mobile and it shows the winners)</li><li>An app that analyses twitter messages and uses the IBM Sentiment analysis service to determine whether the sentiment is positive or negative. It stors the messages in a Cloudant database</li></ul>'},
{id:'IoT3', name:'Node.js on Heroku', description:'Heroku provides an alternative platform-as-a-service. I have built an app to view my home automation events (that are generated by my Raspberry Pi`s and uploaded to a cloudant database.'},
]},
{name:'HTML5', description:'<p>Although <b>HTML</b> has been around a lonmg time, the new technologies around <b>HTML5, JQuery, AngularJS, Polymer, Restful APIs, Web Sockets, JSON, Web Components</b> etc. will drive a new wave of applications with interfaces designed for many different formats.</p><p>My research is in experimenting with these different development tools and approaches to understand the art-of-the-possible and imagine new application areas that these new approaches open up.</p><p>For any new applicaiton, my current recommendataion would be to use the AngularJS MVC framework in conjunction with the Twitter Bootstrap UI framework.', projects:[
{id:'HTM1', name:'AngularJS', description:'AngularJS is a client-side Model-View-Controller framework for developing web applications. It provides routing, data binding and a very well structured Model View Controller architecture for developing apps. It also has huge support and a vast library of tutorials and re-useable components (called directives). I have built a number of apps with Angular:<ul><li>Administration console on top of a Docker PAAS environment as part of a Proof-of-Concept experiemnet. The code is available at <a href="https://github.com/LesterThomas/adminConsole">AdminConsole on Github</a></li><li>Sharepoint user interfaces - I have a number of apps build on top of the native Sharepoint REST api. Sources available at <a href="https://github.com/LesterThomas/Sharepoint">Sharepoint apps</a></li></ul> '},
{id:'HTM2', name:'Polymer', description:'Polymer is a library that makes it easier to build using Web Components. This website has been built using Polymer (as a test exercise). Whilst undoutably the future for web app development, it does not have the same level of community resources as Angular. It is on my `watch-list` of new technologies to keep abreast of.'},
]},
{name:'Massive-scale Architectures', description:'My research is in testing different PAAS approaches and platforms and understanding how they work, any limitations or constraints that they impose and what possibilities they open up. I have experimented no-SQL databases (reddis, MongoDb, Cloudant), stateless applications, infrastructure-as-a-service and Platform-as-a-service, containerisation (using Docker) to run applications that scale in the cloud.', projects:[
]}
]
