[
{"name":"The Open Group Architecture Framework (TOGAF)", "description":"<p>TOGAF is the leading Framework for designing, planning, implementing, and governing an Enterprise Architecture. TOGAF is used across many industries and describes a standard process <b>ADM</b> and supporting techniques to drive the strategy and architecture of your Enterprise. It covers Business, Application, Data, and Technology Architectures. </p>", "projects":[
{"name":"Architecture Development Method (ADM)", "description":"<table><tr><td>The TOGAF ADM (Architecture Development Method) describes the process for developing and managing the lifecycle of an enterprise architecture, and forms the core of TOGAF. The ADM process sets the Vision, creates the target architecture as a set of business, information, application and technology reference architectures. It then recommends that organisations look for opportunities to implement projects that move the organisation towards the target over a number of interim architecture steps. It provides guidance for Architecture Governance processes to keep these people and projects alighed to the organisations target vision. It is an iterative process, with iterations being performed around each sub-component and around the overall process.</td><td><img src=\"images/TOGAF_ADM.jpg\"/></td></tr></table>"},
{"name":"Enterprise Continuum, and Architecture Repository", "description":"<table><tr><td>The Enterprise Continuum provides a framework for organising the architecture assets. The Enterprise Continuum is broken down into the Architecture Continuum, which manages the fundamental architecture artefacts, and the Solution Continuum, which manages the solution building-blocks. Both the Architecture and Solutions Continuum have foundation, cross-industry, industry-specific and organisation specific models.</td></tr><tr><td><img src=\"images/architecture contiuum.png\"/></td></tr></table>"},
{"name":"TOGAF Accreditation", "description":"TOGAF provides accredited training courses, two levels of formal accreditation and a registry of all accredited architects (<a href=\"https://togaf9-cert.opengroup.org/certified-individuals\">TOGAF Registry</a>). For more information see <a href=\"http://www.opengroup.org/subjectareas/enterprise/togaf\">The Open Group</a>."}
]},
{"name":"Tele-Management Forum", "description":"<p>The <a href=\"https://www.tmforum.org/\">TM Forum</a> is the Global industry association of the Telecommunications industry. It connects service providers and suppliers and provides thought leadership, research, collaboration programmes, events and training.</p>", "projects":[
{"name":"TM Forum Frameworx", "description":"TM Forum <a href=\"https://www.tmforum.org/tm-forum-frameworx/\">Frameworx</a> provides the industry standard models for the Communications Industry, as described in the TOGAF Architecture Continuum. It provides process (<b>eTOM</b>), information (<b>SID</b>), application (<b>TAM</b>) and integration APIs."},
{"name":"Catalyst programmes", "description":"Catalysts are rapid fire, member-driven proof-of-concept projects which both inform and leverage TM Forum best practices and standards, connecting service providers, technology suppliers, and global enterprises to create innovative solutions to common industry challenges. The current set of Catalyst projects are organised into <b>Customer Centricity</b>, <b>Agile Business &amp IT</b> and <b>Open Digital Ecosystem</b> workstreams. For more information, see <a href=\"https://www.tmforum.org/collaboration/catalyst-program/\">Catalyst Program</a>."}
]},
{"name":"Vodafone Systems Architecture Reference Model", "description":"<p>Vodafone adopts the TOGAF methodology to develop its Enterprise Architecture. It has a series of Organisation specific architecture frameworks that build on the TM Forum Frameworx and follow the TOGAF methodology. Its architecture frameowrks cover business, information, application and integration API's and it has solution architecture frameworks that tie the  architecture building-blocks into a series of target solution platforms.</p>", "projects":[
{"name":"Architecture Frameworks (COBRA)", "description":"The Vodafone Architecture Framwork is called COBRA - Common OSS/BSS Reference Architecture and has models for business process, business capability, information, application and SOA integration."},
{"name":"Solutions Framework", "description":"The Vodafone Solutions Framework defines a set of target Platforms that each Vodafone operator aims towards. The target platforms encompass the business, application, information and integration frameworks and allow sharing and re-use of best-practice across Vodafone markets, as well as enabling a number of shared services."}
]}
]
